# 19.10.24
#
# 1. настроили github и python
# 2. обсудили множества чисел (простые, натуральные, целые, рациональные, иррациональные), объединение, пересечение множеств
# 3. диаграмма Эйлера-Венна, кванторы
# 4. повторили сложение дробей, степени, понятие функции, графики sin и cos
# 5. вопросы по школьной математике
# 6. вопросы по теорверу, статистике

# всё работет, осталось дождаться загрузки

# c:\Users\burya\AppData\Local\Programs\Python\Python312\Scripts\pre-commit.exe run --all-files for check on linter

"""Github lesson12222."""

1 + 1
